#κατασκευή array
@a=('john','paul','george','Ringo', 11, 3);
#H Perl έχει ενσωματωμένη μια εντολή που ονομάζεται sort. Η εντολή, στην πιο απλή
#μορφή της ταξινομεί τα στοιχεία μιας λίστας σύμφωνα με την σειρά τον χαρακτήρων
#όπως αυτοί βρίσκονται στον ASCII.
@sorted_a=sort (@a);
print "@a", "\nThe array elements in ASCIIbetical order are: @sorted_a";
#Η εντολή splice χρησιμοποιείται για την αφαίρεση και αντικατάσταση στοιχείων σε
#ένα array. Συντάσεται ώς splice(@array, τιμή του πρώτου στοιχείου που θα
#αφαιρεθεί, αριθμός συναπτών στοιχείων που θα αφαιρεθούν, (λίστα στοιχείων αντικατάστασης)).
@removed_a=splice (@a, 0, 2, (papito, guadeloupe, jim));
print "\nThe new array is: @a", "\nThe removed elements are: @removed_a";
#Η $[. είναι μια ειδική μεταβλητή της perl. Η μεταβλητή αυτή, τύπου scalar,
#περιέχει το νούμερο από το οποίο ξεκινά η αρίθμηση των στοιχείων των array.
#Προεπιλεγμένα η μεταβλητή ισούται με 0. Όμως, έχουμε τη δυνατότητα να την
#ορίσουμε εκ νέου. Αν για παράδειγμα εδώ την ορίσουμε 3 και έπειτα ζητήσουμε να
#εκτυπωθεί το στοιχείο του array με αριθμό 3, θα μας επιστρέψει το πρώτο στοιχείο.
$[=3;
print "\nThe #3 element of the array is: $a[3]";
