open (IN1, 'P21918.fasta');

while (<IN1>){
if ($_=~m/^(\w)/){
  $_=~s/\n//;
  $seq.=$_;
}
}

$l=length $seq;

for ($i=0; $i<=$l-3; $i++){
# for ($j=4; $j<=5; $j++) h litou to ekane etsi kai meta sto substr (,,$j)
  $pro=substr($seq, $i ,5);
  if ($pro=~m/^(VG\w{1,2}A)/){
    print "To pattern vrethike na ksekinaei apo ti thesi ", $i+1, ": $1\n";
  }
}

################################################################################

open (IN2, 'P21918.txt');
open (OUT2, '>P21918(2).fasta');
while (<IN2>){
  if ($_=~m/^AC\s+(\w+)/){
    print OUT2 ">$1\n";
  }
  if ($_=~m/^\s+(.+)/){
    $_=~s/ //g;
    print OUT2 "$_";
  }
}
#fasta είναι είτε σε μια γραμμή είτε σε 60δες, ανάλογα τι μας ζητάει
################################################################################


open (IN3, 'P21918.txt');

$c=1;
while (<IN3>){
  if ($_=~m/^FT\s+TRANSMEM\s+(\d+)\.\.(\d+)/){
    push (@a, $1);
    push (@b, $2);
  }
}
  if ($_=~m/^\s+(\w+)/){
    $_=~s/ //g;
    $_=~s/\n//;
    $seq.=$_;
  }
  for ($i=0; $i<=$#a; $i++){
  #ΠΡΟΣΟΧΗ!!!!
   $s=substr($seq, $a[$i]-1, $b[$i]-$a[$i]+1); #προσοχη εδω! αν δεν βαλω το -1 θα χασω ενα στην αρχη!!!!!!!!!
      print "TM$c: $s\n";
    $c++;
  }

#Αν στις εξετάσεις μου πει οτι εχω πρωτεΐνες με ΕΝΑ ΜΟΝΟ διαμεμβρανικο
#μπορώ να το κανω πιο απλά ΣΟΣ! χωρις push σε πινακα !
